org-content/hugo.org
#+STARTUP: content
#+options: author:nil
#+HUGO_BASE_DIR: ../
#+hugo_level_offset: 0

** DONE The Best Way To Make Quick Presentations :org_mode:presentations:@Productivity:
CLOSED: [2020-12-30 Wed 11:15]
:PROPERTIES:
:EXPORT_HUGO_BUNDLE: quick-presentations
:EXPORT_FILE_NAME: index
:END:
:LOGBOOK:
CLOCK: [2020-12-30 Wed 10:11]--[2020-12-30 Wed 10:32] =>  0:21
CLOCK: [2020-12-30 Wed 09:06]--[2020-12-30 Wed 10:11] =>  1:05
:END:

*** Overview

There are three aspects to a slideshow presentation:
- the content
- the design
- the delivery

This post focuses on the content and design. Imagine yourself, looking to quickly prepare a slideshow, and opening up google slides or powerpoint. What you really bring to the table is the content, but along the way you have to deal with manually composing slides; moving the textbox a little to the right, changing the font, resizing images.

Would it be possible to write a program that lets you forget about design, focus on the content, and then have a polished presentation generated for you? You would need a way to communicate the content with the program, an outliner tool. hmm

It turns out that there is a great package that accomplishes exactly this! See [[https://github.com/yjwen/org-reveal][org-reveal]], a package that uses [[https://revealjs.com/][reveal.js]] to turn plain text org files into html slideshow presentations. You can include all the typical presentation things: images, code, tables, etc. See an example presentation [[https://revealjs.com/][here]].

*** Installation

In spacemacs =org-reveal= is easy to setup. You enable it using org variables as follows and set the =org-re-reveal-root= to where you installed =reveal.js= on your computer:
#+begin_src elisp
  (org :variables
       org-enable-reveal-js-support t
     )

  (setq org-re-reveal-root "file:///home/gautierk/.npm-global/lib/node_modules/reveal.js/")
#+end_src

*** Usage

To use org-reveal, outline your presentation in an org file. Use org metadata to set things like the title and author. When you're ready to export, run =org-export-dispatch= (=, e e= on spacemacs) and then type =v b= to export using reveal. You did it! For more options see the [[https://github.com/yjwen/org-reveal][org-reveal]] README. [[https://ruborcalor.github.io/Academic-Cluster-Presentation/][Here]] is an example presentation I made.

*** COMMENT Similar post
https://cestlaz.github.io/posts/using-emacs-50-presentations/

He does a good job.

First introduces the problem and then says how emacs solves the problem as opposed to introducing emacs as a solution without making it clear what problem is being solved.

Don't think there is anything I would add that cestlaz didn't already so I'm not sure if it's worth writing this post.

Do I want to talk about how to host on github pages? Not sure. I should write it down for myself though, and then might as wel publish.
